<?php
    $GLOBALS['WORD_TC'] = array(
        'NOT_AUTHORIZED' => "對唔住,你既邀請連結無效。請檢查你的連結是否完整。如繼續出現問題,請短訊至@CivicDataHK",
        'LINK_QUOTA_USED_UP' => "對唔住,你既邀請連結限額已經用完。你仲有無朋友玩緊公民聲吶?不如叫佢地邀請你?\n\n如有問題,請短訊至@CivicDataHK",
        'WELCOME_CHOOSE_LANGUAGE' => '請選擇語言：',
        'WELCOME' => "公民數據以滾動投票方式讓支持民主的選民即時投票同睇結果。選民每月一號投票及查看各政團的最新支持度，以求在九月四號的立法會選，讓你做更明智既投票決定。",
        'WELCOME_TERMS' => "`「使用條款」`\n\n參加人士必須小心輸入所有資料，「確認」遞交後將不能作出任何修改。\n\n".
            '參加人士必須確保傳送的任何電子訊息，均不含任何病毒或可能影響此投票運作的元素，'.
            '又或對公民聲吶的資料或系統造成損害、干擾或刪減。電訊商可能會向發送使用者收取流動數據費用，'.
            "有關費用與公民聲吶無關。\n\n".
            '所有收集的個人資料只用作是次活動的身分驗証，傳送時 Telegram 會使用 256-位元 AES 加密，'.
            '以確保有關資料實際上無法被人破解。加密技術由 Telegram 提供，並非由公民聲吶負責。',
        'WELCOME_TERMS_AGREE' => '同意以上使用條款?',
        'INVITE_NO_PRIVILEGE' => '沒有權限',
        'INVITE_ALREAY_GENERATED' => "你已有邀請連結。\n",
        'INVITATION_MSG' => '由於你是第一次投票，你可以邀請 %d 個支持民主的朋友來投票，請複製以下訊息給你 Telegram、WhatsApp 或 Facebook 上的朋友。',
        'INVITATION_LINK' => "我誠意邀請你參與公民聲吶睇9月立法會選舉最新民意調查結果。\n\n".
                "公民聲吶以滾動投票方式讓支持民主的選民即時投票和睇結果。你可查看各政團的最新支持度，以求在九月四號的立法會選舉，讓你做更明智的投票決定。\n\n".
                "入公民數據睇最新投票調查結果\n1. 請下載 Telegram\n2. Click入這條link: [%1$s](%1$s)\n".
                "3. 揀你這一刻想支持的政黨或候選人\n4. 即時看最新投票結果\n5. 下個月同一時間再投，看最新民調結果！", 
        'INVITATION_LINK_USED_NOTIFICATION' => '「%1$s」 使用了你的邀請連結 [%2$s](%2$s)，此連結還可使用 %3$d 次。',
        'SURVEY_NOT_START' => '你還未開始投票，請使用 /start 開始。',
        'SURVEY_Q1_NOT_AGREE' => '對不起，我們需要你的同意，才能繼續，懇請再考慮。',
        'SURVEY_Q2' => '你的選民登記屬於那個選區？',
        'SURVEY_Q3' => '假如明天是立法會選舉，你會投票支持以下哪一張名單（名單內名字是現在傳媒盛傳會代表出選的人）？',
        'SURVEY_Q4' => '咁你點睇「%s」係九月四日既勝出機會？',
        'SURVEY_Q5' => '那麼，假設有香港有退選制度，如果你支持既名單退選，你會支持另外既邊張名單？',
        'SURVEY_Q6' => '你揀既係「%1$s」，勝算「%2$s」。若無得揀「%1$s」，則會揀「%3$s」。肯定？',
        'SURVEY_Q7' => '假如明天是立法會選舉，在「區議會（第二）功能組別」（俗稱超區）中，你會投票支持以下哪一位候選人（以下名字是現在傳媒盛傳會代表出選的人）？',
        'SURVEY_Q8' => '咁你點睇「%s」係九月四日既勝出機會？',
        'SURVEY_Q9' => '那麼，假設有香港有退選制度，如果你支持既名單退選，你會支持另外既邊張名單？',
        'SURVEY_Q10' => '10 你揀既係「%1$s」，勝算「%2$s」。若無得揀「%1$s」，則會揀「%3$s」。肯定？',
        'SURVEY_Q11' => '為協助我們分析，我想問多你少少個人資料。請問你係唔係合資格既選民呢？',
        'SURVEY_Q12' => '請問你幾歲？',
        'SURVEY_Q13' => '請問你的職業是什麼類型？',
        'SURVEY_Q14' => '',
        'SURVEY_Q15' => '',
        'SURVEY_Q2_CONFIRM' => '確認投給「%s」？',
        'SURVEY_THANKS' => '多謝投票。',
        'SURVEY_THANKS_REMIND' => '請於下個月一號回來再投票，同時看最新投票結果。到時我們會再提醒你，謝謝。',
        'SURVEY_RESULT' => "「`%s`」 選區的結果 (共 %d 票)：\n\n",
        'SURVEY_RESULT_MORE' => '還有其他 ',
        'SURVEY_RESULT_LINK' => '([詳細的結果](http://votsonar.civicdata.hk/result.html))',
        'SURVEY_RESULT_RESTART_INSTRUCTION' => "\n",
        'INVALID_INPUT' => '對不起，我不明白',
        'ALREADY_VOTE' => "你已投票了。你可以用 /result 查看投票結果。",
    );
    
    
    $GLOBALS['ANSWER_KEYBOARD_TC'] = array(
        'WELCOME_LANGUAGE' => array('廣東話', 'English'),
        'Q1_AGREE' => '👌 我同意',
        'Q1_DISAGREE' => '🚫 不!',
        'Q1' => array('👌 我同意', '🚫 不!'),
        'Q2' => getQ2Keyboard(),
        'Q2_CONFIRM_YES' => '✔ 確定',
        'Q2_CONFIRM_NO' => '❌ 選錯了',
        'Q2_CONFIRM_YES_ANSWERS' => array('yes', 'confirm', 'ok', '✔ 確定', '確定'),
        'Q2_CONFIRM_NO_ANSWERS' => array('no', 'nope', '❌ 選錯了', '否', '不'),
        'Q2_CONFIRM' => array ('✔ 確定', '❌ 選錯了'),
        'Q3' => getQ3Keyboard(),
        'Q4' => array('0%(無機會)', '10%(一成)', '20%(機會不大)', '30%(三成)', '40%(四成)', '50%(一半半)', '60%(六成)', '70%(七成)', '80%(頗大機會)', '90%(九成)', '100%(一定當選)', '唔想講'),
        'Q5' => getQ3Keyboard(),
        'Q6' => array('👌 揀定', '🚫 再揀過'),
        'Q7' => getQ3Keyboard(),
        'Q8' => array('0%(無機會)', '10%(一成)', '20%(機會不大)', '30%(三成)', '40%(四成)', '50%(一半半)', '60%(六成)', '70%(七成)', '80%(頗大機會)', '90%(九成)', '100%(一定當選)', '唔想講'),
        'Q9' => getQ3Keyboard(),
        'Q10' => array('👌 揀定', '🚫 再揀過'),
        'Q11' => array('👌 係',  '🚫 唔係', '❓ 唔清楚'),
        'Q12' => array('18歲以下', '18-25', '26-50', '51-75', '76-98', '唔想講'),
        'Q13' => array('經理及行政人員', '專業人員', '輔助專業人員', '文員', '服務工作及商店銷售人員', '漁農業熟練工人', '手工藝及有關人員', '機台及機器操作員及裝配員', '非技術工人', '學生', '家庭主婦', '不能辨別', '其他(包括失業、巳退休、及其他非在職者)', '唔想講'),
        'PARTY_NOT_YET_DECIDE' => '未決定',
        'PARTY_NO_SECOND_CHOICE' => '沒有第二選擇'
    ); 
    
function getQ3Keyboard(){
    $aryParty = array(
        '1' => '民主黨',
        '2' => '公民黨',
        '3' => '工黨',
        '4' => '街工',
        '5' => '民協',
        '6' => '新民主同盟',
        '7' => '社民連',
        '8' => '人民力量',
        '9' => '學民思潮',
        '10' => '青年新政本民前',
        '11' => '熱血公民',
        '12' => '民建聯',
        '13' => '工聯會',
        '14' => '經民聯',
        '15' => '新民黨鄉事派',
        '16' => '自由黨',
        '17' => '民主思路',
        '18' => '新思維',
        '19' => '其他',
        '20' => '未決定'
    );
    return array(
        0 => $aryParty,
        1 => $aryParty,
        2 => $aryParty,
        3 => $aryParty,
        4 => $aryParty
    );
}

function getQ2Keyboard(){
    return array(
       0 => '香港島',
       1 => '九龍東',
       2 => '九龍西',
       3 => '新界東',
       4 => '新界西'
    );
}
?>