<?php
    $GLOBALS['WORD_TC'] = array(
        'NOT_AUTHORIZED' => "對唔住,你既邀請連結無效。請檢查你的連結是否完整。如繼續出現問題,請短訊至@CivicDataHK",
        'LINK_QUOTA_USED_UP' => "對唔住,你既邀請連結限額已經用完。你仲有無朋友玩緊公民聲吶?不如叫佢地邀請你?\n\n如有問題,請短訊至@CivicDataHK",
        'WELCOME_CHOOSE_LANGUAGE' => '請選擇語言：',
        'WELCOME' => "公民數據以滾動投票方式讓支持民主的選民即時投票同睇結果。選民每月一號投票及查看各政團的最新支持度，以求在九月四號的立法會選，讓你做更明智既投票決定。\n\nVotsonar lets voters vote and see polling results in real time. Participants get to vote on the 1st of every month, see the latest polling data of all parties and candidates, and be able to make a wiser choice in the Legislature Council (LegCo) Election on September 4th, 2016.",
        'WELCOME_TERMS' => "`「使用條款」`\n\n參加人士必須小心輸入所有資料，「確認」遞交後將不能作出任何修改。\n\n".
            '參加人士必須確保傳送的任何電子訊息，均不含任何病毒或可能影響此投票運作的元素，'.
            '又或對公民聲吶的資料或系統造成損害、干擾或刪減。電訊商可能會向發送使用者收取流動數據費用，'.
            "有關費用與公民聲吶無關。\n\n".
            '所有收集的個人資料只用作是次活動的身分驗証，傳送時 Telegram 會使用 256-位元 AES 加密，'.
            '以確保有關資料實際上無法被人破解。加密技術由 Telegram 提供，並非由公民聲吶負責。',
        'WELCOME_TERMS_AGREE' => '你同意以上使用條款嗎？',
        'INVITE_NO_PRIVILEGE' => '沒有權限',
        'INVITE_ALREAY_GENERATED' => "你已有邀請連結。\n",
        'INVITATION_MSG' => '由於你是第一次投票，你可以邀請 %d 個`*你所熟識，而且支持民主的朋友*`來投票。請複製以下訊息給你 Telegram、WhatsApp、Line 或 Facebook Messenger上的朋友（但請不要放在公開場合，如facebook page上分享）。
👇👇👇',
        'INVITATION_LINK' => "我誠意邀請你參與公民聲吶睇9月立法會選舉最新民意調查結果。\n\n".
                "公民聲吶以滾動投票方式讓支持民主的選民即時投票和睇結果。你可查看各政團的最新支持度，以求在九月四號的立法會選舉，讓你做更明智的投票決定。\n\n".
                "入公民數據睇最新投票調查結果\n1. 請下載 Telegram\n2. Click 入最底那條 link \n".
                "3. 揀你這一刻想支持的政黨或候選人\n4. 即時看最新投票結果\n5. 下個月同一時間再投，看最新民調結果！\n\n".'邀請連結： [%1$s](%1$s) ',
        'INVITATION_LINK_USED_NOTIFICATION' => '「%1$s」 使用了你的邀請連結 [%2$s](%2$s)，此連結還可使用 %3$d 次。',
        'INVITATION_QUOTA' => '你還可邀請 %d 個朋友',
        'INVITATION_NO_LINK' => '你沒有邀請連結',
        'SURVEY_NOT_START' => '你還未開始投票，請使用 /start 開始。',
        'SURVEY_Q1_NOT_AGREE' => '對不起，我們需要你的同意，才能繼續，懇請再考慮。',
        'SURVEY_Q2' => '請問你上屆2012立法會選舉，投左票俾邊張名單？',
        'SURVEY_Q3' => '請問你今屆係唔係合資格既選民呢？',
        'SURVEY_Q4' => '請問你住係邊個選區？',
        'SURVEY_Q5' => '假如明天是立法會選舉，你會投票支持以下哪一張地區直選的名單（名單內名字是現在傳媒盛傳會代表出選的人）？',
        'SURVEY_Q6' => '咁你點睇「%s」係九月四日既勝出機會？',
        'SURVEY_Q7' => '除了上面那張名單，你有沒有第二張最想支持的名單？',
        'SURVEY_Q8' => '2012年, 你投了「%1$s」，而今年9月嘅地區直選選舉你首選係「%2$s」，你認為佢嘅勝算係「%3$s」。
除了「%2$s」，你第二最想㨂嘅係「%4$s」。
肯定？',
        'SURVEY_Q9' => '假如明天是立法會選舉，在「區議會（第二）功能組別」（俗稱超區）中，你會投票支持以下哪一位候選人（以下名字是現在傳媒盛傳會代表出選的人）？',
        'SURVEY_Q10' => '咁你點睇「%s」係九月四日既勝出機會？',
        'SURVEY_Q11' => '除了上面那張名單，你有沒有第二個最想支持的候選人？',
        'SURVEY_Q12' => '今年9月嘅超區直選，你首選係「%1$s」，你認為佢嘅勝算係「%2$s」。
除了「%1$s」，你第二最想㨂嘅係「%3$s」。
肯定？',
        'SURVEY_Q13' => '為協助我們分析，我想問多你少少個人資料。

請問你幾歲？ （請將整數年齡輸入在對話格上）',
        'SURVEY_Q14' => '請問你的職業是什麼類型？',
        'SURVEY_Q15' => '',
        'SURVEY_Q2_CONFIRM' => '確認投給「%s」？',
        'SURVEY_THANKS' => '多謝投票。',
        'SURVEY_THANKS_REMIND' => "多謝你既參與！\n請於下個月6月1號再番黎投票，同時睇最新投票結果。公民數據到時會send提示俾你。",
        'SURVEY_RESULT' => "下面係「`%s`」 5 月最新民調結果，現時總共 %d 人揀咗名單。\n\n",
        'SURVEY_RESULT_MORE' => '還有其他',
        'SURVEY_RESULT_LINK' => '([詳細的結果](http://votsonar.civicdata.hk/result.html))',
        'SURVEY_RESULT_RESTART_INSTRUCTION' => "\n",
        'SURVEY_ENDED' => '五月份正式民調已經係5月11日00:00完結，多謝大家參與！跟著我們將會準備民調較詳細分析報告，完成後將會立即通知大家。下一次的正式民調將會係6月1日舉行，敬請留意。

希望你繼續努力推動公民聲吶民調。誠意邀請你同你一樣都係支持香港民主自決的朋友參加，一齊用數據打選戰！
',
        'INVALID_INPUT' => '對不起，我不明白',
        'ALREADY_VOTE' => "你已投票了。你可以用 /result 查看投票結果，或按右側「/」鍵選擇所需功能。",
    );


    $GLOBALS['ANSWER_KEYBOARD_TC'] = array(
        'WELCOME_LANGUAGE' => array('廣東話', 'English'),
        'Q1_AGREE' => '👌 我同意',
        'Q1_DISAGREE' => '🚫 不!',
        'Q1' => array('👌 我同意', '🚫 不!'),
        'Q2' => getVoter2012KeyboardAll(),
        'Q3' => array('👌 係', '🚫 唔係'),
        'Q4' => getQ2Keyboard(),
        'Q4_CONFIRM_YES' => '✔ 確定',
        'Q4_CONFIRM_NO' => '❌ 選錯了',
        'Q4_CONFIRM_YES_ANSWERS' => array('yes', 'confirm', 'ok', '✔ 確定', '確定'),
        'Q4_CONFIRM_NO_ANSWERS' => array('no', 'nope', '❌ 選錯了', '否', '不'),
        'Q4_CONFIRM' => array ('✔ 確定', '❌ 選錯了'),
        'Q5' => getQ3Keyboard(),
        'Q6' => array('0%(無機會)', '10%(一成)', '20%(機會不大)', '30%(三成)', '40%(四成)', '50%(一半半)', '60%(六成)', '70%(七成)', '80%(頗大機會)', '90%(九成)', '100%(一定當選)', '唔想講'),
        'Q7' => getQ3Keyboard(),
        'Q8' => array('👌 揀定', '🚫 再揀過'),
        'Q9' => getSuperPartyKeyboard(),
        'Q10' => array('0%(無機會)', '10%(一成)', '20%(機會不大)', '30%(三成)', '40%(四成)', '50%(一半半)', '60%(六成)', '70%(七成)', '80%(頗大機會)', '90%(九成)', '100%(一定當選)', '唔想講'),
        'Q11' => getSuperPartyKeyboard(),
        'Q12' => array('👌 揀定', '🚫 再揀過'),
        'Q13' => array('18歲以下', '18-25', '26-50', '51-75', '76-98', '唔想講'),
        'Q14' => array('經理及行政人員', '專業人員', '輔助專業人員', '文員', '服務工作及商店銷售人員', '漁農業熟練工人', '手工藝及有關人員', '機台及機器操作員及裝配員', '非技術工人', '學生', '無償家庭照顧者', '不能辨別', '其他(包括失業、巳退休、及其他非在職者)', '唔想講'),
        'PARTY_NOT_YET_DECIDE' => '未決定',
        'PARTY_NO_SECOND_CHOICE' => '沒有第二選擇',
        'PARTY_SUPER' => '區議會（第二）功能組別',
    );

function getQ3Keyboard(){
    return array(
        0 => array('民建聯（鍾樹根）',
                    '民建聯第二名單',
                    '工聯會',
                    '經民聯',
                    '新民黨（葉劉淑儀）',
                    '自由黨',
                    '民主思路',
                    '新思維',
                    '民主黨（許智峯）',
                    '公民黨（陳淑莊）',
                    '工黨（何秀蘭）',
                    '人民力量（劉嘉鴻）',
                    '香港眾志（羅冠聰）',
                    '青年新政（梁頌恆）',
                    '熱血公民（鄭錦滿）'),
        1 => array('民建聯（陳鑑林）',
                    '工聯會',
                    '經民聯',
                    '新民黨',
                    '謝偉俊',
                    '自由黨',
                    '民主思路',
                    '新思維',
                    '民主黨（胡志偉）',
                    '公民黨（譚文豪）',
                    '工黨 (胡穗珊)',
                    '民協',
                    '人民力量（譚得志）',
                    '香港眾志（黎汶洛）',
                    '東九龍社區關注組（陳澤滔）',
                    '熱血公民（黃洋達）'),
        2 => array('民建聯（蔣麗芸）',
                    '工聯會',
                    '經民聯（梁美芬）',
                    '新民黨',
                    '自由黨',
                    '民主思路',
                    '新思維',
                    '民主黨（黃碧雲）',
                    '公民黨（毛孟靜）',
                    '工黨 （趙仕信）',
                    '民協',
                    '社民連（吳文遠）',
                    '香港列陣（岑敖輝）',
                    '青年新政（游蕙禎）',
                    '熱血公民（黃毓民）'),
        3 => array('民建聯（陳克勤）',
                    '民建聯（葛珮帆）',
                    '工聯會',
                    '經民聯',
                    '新民黨',
                    '新進步聯盟',
                    '自由黨',
                    '方國珊',
                    '民主思路',
                    '新思維',
                    '民主黨（林卓庭）',
                    '公民黨（楊岳橋）',
                    '工黨（張超雄）',
                    '新民主同盟（范國威）',
                    '社民連 （梁國雄）',
                    '人民力量 （陳志全）',
                    '香港列陣（劉小麗）',
                    '本土民主前線（梁天琦）',
                    '熱血公民（陳雲）'),
        4 => array('民建聯（陳恒鑌）',
                    '民建聯（梁志祥）',
                    '民建聯（譚耀宗）',
                    '工聯會（麥美娟）',
                    '經民聯',
                    '新民黨（田北辰）',
                    '新進步聯盟',
                    '自由黨',
                    '民主思路',
                    '新思維',
                    '民主黨 （尹兆堅）',
                    '公民黨（郭家麒）',
                    '工黨（李卓人）',
                    '民協',
                    '新民主同盟 （譚凱邦）',
                    '街工',
                    '社民連/人民力量（黃浩銘/陳偉業）',
                    '香港列陣（朱凱迪）',
                    '青年新政（黃俊傑）',
                    '熱血公民（鄭松泰）'),
    );
}

function getQ2Keyboard(){
    return array(
       0 => '香港島',
       1 => '九龍東',
       2 => '九龍西',
       3 => '新界東',
       4 => '新界西'
    );
}

function getSuperPartyKeyboard(){
    return array('民建聯第一名單',
                    '民建聯第二名單',
                    '工聯會',
                    '其他建制派名單',
                    '民主黨（涂謹申）',
                    '民主黨（鄺俊宇）',
                    '公民黨',
                    '民協',
                    '新民主同盟（關永業）',
                    '街工（梁耀忠）',
                    '司馬文');
}


function getVoter2012KeyboardAll(){
    $ret = array();
    $voter2012 = getVoter2012Keyboard();
    foreach (getQ2Keyboard() as $districtKey => $district){
        foreach($voter2012[$districtKey] as $voter){
            array_push($ret, "[$district] $voter");
        }
    }
    array_push($ret, '我未係選民', '我合資格但沒有投票');
    return $ret;
}
function getVoter2012Keyboard(){
    return array(
        0 => array('許清安',
                '單仲偕',
                '勞永樂',
                '劉嘉鴻',
                '鍾樹根',
                '吳榮春',
                '何秀蘭',
                '葉劉淑儀',
                '王國興',
                '陳家洛',
                '何家泰',
                '曾鈺成',
                '劉健儀',
                '吳文遠',
                //'我未係選民', '我合資格但沒有投票'
                ),
        1 => array('梁家傑',
                '黃國健',
                '陶君行',
                '嚴鳳至',
                '胡志偉',
                '陳鑑林',
                '謝偉俊',
                '黃洋達',
                '譚香文',
                //'我未係選民', '我合資格但沒有投票'
                ),
        2 => array('黃以謙',
                '黃碧雲',
                '譚國僑',
                '黃逸旭',
                '蔣麗芸',
                '黃毓民',
                '林依麗',
                '梁美芬',
                '毛孟靜',
                //'我未係選民', '我合資格但沒有投票'
                ),
        3 => array('梁國雄',
                '葉偉明',
                '劉慧卿',
                '梁安琪',
                '龐愛蘭',
                '葛珮帆',
                '陳志全',
                '邱榮光',
                '陳克勤',
                '張超雄',
                '蔡耀昌',
                '范國威',
                '田北俊',
                '黃成智',
                '湯家驊',
                '何民傑',
                '龐一鳴',
                '方國珊',
                '陳國強',
                //'我未係選民', '我合資格但沒有投票'
                ),
        4 => array('梁志祥',
                '麥美娟',
                '陳樹英',
                '陳偉業',
                '麥業成',
                '曾健成',
                '郭家麒',
                '田北辰',
                '何君堯',
                '陳一華',
                '梁耀忠',
                '陳恒鑌',
                '陳強',
                '李永達',
                '李卓人',
                '譚耀宗',
                //'我未係選民', '我合資格但沒有投票'
                )
    );
}
?>
